---
type: FilterElementIdRule
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FilterElementIdRule

`Autodesk.Revit.DB.FilterElementIdRule` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterElementIdRule | 2011 | `public FilterElementIdRule ( FilterableValueProvider valueProvider , FilterNumericRuleEvaluator evaluator , ElementId ruleValue )` |
| Method | UsesLevelFiltering | 2022 | `public static bool UsesLevelFiltering ( Document doc , ElementId parameterId )` |
| Property | RuleValue | 2011 | `public ElementId RuleValue { get ; set ; }` |